Revit 2024 API
Noise.NoisePhase Property
 The property labeled "Phase" from the "Noise" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string NoisePhase { get; }
Visual Basic
Public Shared ReadOnly Property NoisePhase As String
	Get
Visual C++
public:
static property String^ NoisePhase {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble".
See Also
Noise Class
Autodesk.Revit.DB.Visual Namespace